app/Services/EventService.php

select exists(select * from `events` where date(`start_date`) = '2022-07-15' and time(`end_date`) > '09:32' and time(`start_date`) < '10:32') as `exists`
---
    public static function checkEventDuplication($eventDate, $startTime, $endTime)
    {
        return DB::table('events')
        ->wheredate('start_date', $eventDate)
        ->wheretime('end_date', '>',$startTime)
        ->wheretime('start_date', '<', $endTime)
        ->exists();

select count(*) as aggregate from `events` where date(`start_date`) = '2022-07-15' and time(`end_date`) > '09:32' and time(`start_date`) < '10:32'
---
    public static function countEventDuplication($eventDate, $startTime, $endTime)
    {
        return DB::table('events')
        ->wheredate('start_date', $eventDate)
        ->wheretime('end_date', '>',$startTime)
        ->wheretime('start_date', '<', $endTime)
        ->count();