app/Http/Livewire/Register.php

    public function register()
    {
        $this->validate();

        // dd($this);

        User::create([
            "name" => $this->name,
            "email" => $this->email,
            "password" => Hash::make($this->password),
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('いいい', 'test3@test.com', '$2y$10$nw5CgKwPZ2P2B41BORZAF.QancLeBNdBQIvegJ3cxWRagWCLv34Ka', '2022-08-12 12:48:47', '2022-08-12 12:48:47')