app/Http/Controllers/EventController.php

select * from `events` order by `start_date` asc limit 10 offset 100
select count(*) as aggregate from `events`
---
    public function index()
    {
        $events = DB::table("events")
        ->orderBy("start_date", "asc")
        ->paginate(10);

insert into `events` (`name`, `information`, `start_date`, `end_date`, `max_people`, `is_visible`, `updated_at`, `created_at`) values ('azsvfvw', 'sdbdfa', '2022-08-20 12:00:00', '2022-08-20 13:00:00', '5', '1', '2022-08-18 12:39:54', '2022-08-18 12:39:54')
---
    public function store(StoreEventRequest $request)
    {
        $check = EventService::checkEventDuplication(
            $request['event_date'], $request['start_time'], $request['end_time']
        );

        if($check)
        {
            session()->flash('status', 'この時間帯はすでに他の予約でいっぱいです。');
            return view('manager.events.create');
        }

        $startDate = EventService::joinDateAndTime($request['event_date'], $request['start_time']);

        $endDate = EventService::joinDateAndTime($request['event_date'], $request['end_time']);

        Event::create([
            'name' => $request['event_name'],
            'information' => $request['information'],
            'start_date' => $startDate,
            'end_date' => $endDate,
            'max_people' => $request['max_people'],
            'is_visible' => $request['is_visible']
        ]);

select * from `events` where `events`.`id` = 95 limit 1
---
    public function show(Event $event)
    {
        $event = Event::findOrFail($event->id);

select * from `events` where `events`.`id` = 95 limit 1
---
    public function edit(Event $event)
    {
        $event = Event::findOrFail($event->id);

select * from `events` where `events`.`id` = 41 limit 1
---
    public function update(UpdateEventRequest $request, Event $event)
    {
        $check = EventService::checkEventDuplication(
            $request['event_date'], $request['start_time'], $request['end_time']
        );

        if($check)
        {
            session()->flash('status', 'この時間帯はすでに他の予約でいっぱいです。');
            return view('manager.events.edit');
        }

        $startDate = EventService::joinDateAndTime($request['event_date'], $request['start_time']);

        $endDate = EventService::joinDateAndTime($request['event_date'], $request['end_time']);


        $event = Event::findOrFail($event->id);